Tekla Open API Reference for Tekla Structures 2025
Contour Properties
The Contour type exposes the following members.
Properties
Name | Description
ContourPoints
 The contour points belonging to the contour.
Top
See Also
Reference
Contour Class
Tekla.Structures.Model Namespace